src/InformationRegisters/ПротоколСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПротоколСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийПротокола</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МоментВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ПротоколСобытийВызовСервера/Ext/Module.bsl
// Добавляет событие типа Информация в протокол событий
//
// Параметры:
//  Описание - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Число - Момент времени записи предупреждения.
//
Функция ДобавитьИнформацию(Событие, Описание) Экспорт

	Возврат РегистрыСведений.ПротоколСобытий.ДобавитьИнформацию(Событие, Описание);

КонецФункции

// Добавляет событие типа Предупреждение в протокол событий
//
// Параметры:
//  Описание - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Число - Момент времени записи предупреждения.
//
Функция ДобавитьПредупреждение(Событие,Описание) Экспорт

	Возврат РегистрыСведений.ПротоколСобытий.ДобавитьПредупреждение(Событие, Описание);

КонецФункции

// Добавляет событие типа Ошибка в протокол событий
//
// Параметры:
//  Описание - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Число - Момент времени записи сообщения об ошибке.
//
Функция ДобавитьОшибку(Событие, Описание) Экспорт

	Возврат РегистрыСведений.ПротоколСобытий.ДобавитьОшибку(Событие, Описание);

КонецФункции
